# ---------- GLR non-blind deblurring prototxt ----------
# 
input:"data"
input_dim:1
input_dim:1
input_dim:256
input_dim:256
#--------------------scale 0----------------------
layer {
  name: "conv0"
  type: "Convolution"
  bottom: "data"
  top: "conv0"
  convolution_param {
    num_output: 50
    kernel_h: 151
    kernel_w: 1
    stride: 1
    group : 1
    pad: 0
  }
}
#layer {
#  name: "relu0"
#  type: "ReLU"
#  bottom: "conv0"
#  top: "conv0"
#  relu_param{
#    negative_slope: 0.2
#  }
#}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "conv0"
  top: "conv1"
  convolution_param {
    num_output: 50
    kernel_size: 1
    stride: 1
    group : 1
    pad: 0
  }
}
#layer {
#  name: "relu1"
#  type: "ReLU"
#  bottom: "conv1"
#  top: "conv1"
#  relu_param{
#   negative_slope: 0.2
#  }
#}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  convolution_param {
    num_output: 50
    kernel_h: 1
    kernel_w: 151
    stride: 1
    group : 1
    pad: 0
  }
}
#layer {
#  name: "relu2"
#  type: "ReLU"
#  bottom: "conv2"
#  top: "conv2"
#  relu_param{
#    negative_slope: 0.2
#  }
#}
#================================================================
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "conv2"
  top: "conv3"
  convolution_param {
    num_output: 128
    kernel_size: 15
    stride: 1
    group : 1
    pad: 7
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
  relu_param{
    negative_slope: 0.2
  }
}

layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  convolution_param {
    num_output: 128
    kernel_size: 1
    stride: 1
    group : 1
    pad: 0
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
  relu_param{
    negative_slope: 0.2
  }
}

layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  convolution_param {
    num_output: 1
    kernel_size: 7
    stride: 1
    group : 1
    pad: 3
  }
}
layer {
  name: "Sigmoid"
  bottom: "conv5"
  top: "sigmoid"
  type: "Sigmoid"
  loss_weight: 1
}